### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [2]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [3]:
# Pull up data to take a look at it
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

## Player Count

* Display the total number of players

In [4]:
# Display number of players
purchase_data["SN"].count()

780

In [5]:
# To confirm that the total numbers are the same, but aren't
purchase_data["SN"].value_counts()

Lisosia93       5
Iral74          4
Idastidru52     4
Chanastnya43    3
Zontibe81       3
               ..
Jiskimsda56     1
Aeda94          1
Ristydru66      1
Aeri84          1
Ilassast39      1
Name: SN, Length: 576, dtype: int64

In [6]:
# Use len() to get the length of the list of unique players
total_player = len(purchase_data["SN"].value_counts())
total_player

576

In [7]:
# Turning the data into a DataFrame with an index
pd.DataFrame({"Total Players": total_player}, index = [0])

   Total Players
0            576

In [2]:
# Example Output

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [8]:
# Obtaining a number of unique items to confirm the length at the bottom
purchase_data["Item Name"].value_counts()

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Nirvana                                          9
Fiery Glass Crusader                             9
Extraction, Quickblade Of Trembling Hands        9
                                                ..
Riddle, Tribute of Ended Dreams                  1
Gladiator's Glaive                               1
Undead Crusader                                  1
The Decapitator                                  1
Betrayer                                         1
Name: Item Name, Length: 179, dtype: int64

In [9]:
# Use len() to get the length of the unique list of item names
total_unique_item = len(purchase_data["Item Name"].unique())
total_unique_item

179

In [10]:
# Use mean() and get the average, using the Price column
average_price = purchase_data["Price"].mean()
average_price

3.050987179487176

In [11]:
# Use count() to grab the total number of purchases, using the Purchase ID column
total_purchase = purchase_data["Purchase ID"].count()
total_purchase

780

In [12]:
# Use sum() to get the total revenue, using the Price column
total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [13]:
# Put all the data into a DataFrame with an index
purchasing_analysis = pd.DataFrame({
    "Number of Unique Items": total_unique_item,
    "Average Price": average_price,
    "Number of Purchases": total_purchase,
    "Total Revenue": total_revenue}, index = [0])
purchasing_analysis

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [14]:
# Presenting the Average Price and Total Revenue columns properly with $
purchasing_analysis["Average Price"] = purchasing_analysis["Average Price"].map("${:.2f}".format)
purchasing_analysis["Total Revenue"] = purchasing_analysis["Total Revenue"].map("${:.2f}".format)
purchasing_analysis

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780      $2379.77

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     179         $3.05                 780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [15]:
# Get a more focused data on the Gender subject
gender_data = purchase_data[["SN", "Gender"]]
gender_data

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
775     Aethedru70  Female
776         Iral74    Male
777     Yathecal72    Male
778        Sisur91    Male
779      Ennrian78    Male

[780 rows x 2 columns]

In [16]:
# Use unique() to get the unique list
gender_data["Gender"].unique()

array(['Male', 'Other / Non-Disclosed', 'Female'], dtype=object)

In [17]:
# Use value_counts() to pull up information on the unique list length
gender_data["SN"].value_counts()

Lisosia93       5
Iral74          4
Idastidru52     4
Chanastnya43    3
Zontibe81       3
               ..
Jiskimsda56     1
Aeda94          1
Ristydru66      1
Aeri84          1
Ilassast39      1
Name: SN, Length: 576, dtype: int64

In [18]:
# Use nunique() to confirm the number of unique names
unique_total = gender_data["SN"].nunique()

In [19]:
# Use Loc to specifically look for Male in the Gender columun, then extract the unique number
male_data = gender_data.loc[gender_data["Gender"] == "Male"]
unique_male = male_data["SN"].nunique()
unique_male

484

In [20]:
# Use Loc to specifically look for Female in the Gender columun, then extract the unique number
female_data = gender_data.loc[gender_data["Gender"] == "Female"]
unique_female = female_data["SN"].nunique()
unique_female

81

In [21]:
# Use Loc to specifically look for Others/Non-Disclosed in the Gender columun, then extract the unique number
others_data = gender_data.loc[gender_data["Gender"] == "Other / Non-Disclosed"]
unique_others = others_data["SN"].nunique()
unique_others

11

In [22]:
# Getting the percentages of each Gender type
male_perc = unique_male / unique_total
female_perc = unique_female / unique_total
others_perc = unique_others / unique_total

In [23]:
# Checking the value of the percentages
print(male_perc)
print(female_perc)
print(others_perc)

0.8402777777777778
0.140625
0.019097222222222224

In [24]:
# Put all the data in a DataFrame with their respective indexes
gender_demo = pd.DataFrame({
    "Total Count": [unique_male, unique_female, unique_others],
    "Percentage of Players": [male_perc * 100, female_perc * 100, others_perc * 100]}, index = ["Male", "Female", "Other/Non-Disclosed"])
gender_demo

                     Total Count  Percentage of Players
Male                         484              84.027778
Female                        81              14.062500
Other/Non-Disclosed           11               1.909722

In [25]:
# Present the Percentage of Players properly with %
gender_demo["Percentage of Players"] = gender_demo["Percentage of Players"].map("{0:.2f}%".format)
gender_demo

                     Total Count Percentage of Players
Male                         484                84.03%
Female                        81                14.06%
Other/Non-Disclosed           11                 1.91%

In [4]:
# Example Output

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [89]:
# Get a more focused data on Gender and Price
gender_price = purchase_data[["SN", "Gender", "Price"]]
gender_price

                SN  Gender  Price
0          Lisim78    Male   3.53
1      Lisovynya38    Male   1.56
2       Ithergue48    Male   4.88
3    Chamassasya86    Male   3.27
4        Iskosia90    Male   1.44
..             ...     ...    ...
775     Aethedru70  Female   3.54
776         Iral74    Male   1.63
777     Yathecal72    Male   3.46
778        Sisur91    Male   4.19
779      Ennrian78    Male   4.60

[780 rows x 3 columns]

In [90]:
# Copied the code from the previous section and converted it to work in this data set
male_price = gender_price.loc[gender_price["Gender"] == "Male"]
female_price = gender_price.loc[gender_price["Gender"] == "Female"]
others_price = gender_price.loc[gender_price["Gender"] == "Other / Non-Disclosed"]

In [91]:
male_price

                SN Gender  Price
0          Lisim78   Male   3.53
1      Lisovynya38   Male   1.56
2       Ithergue48   Male   4.88
3    Chamassasya86   Male   3.27
4        Iskosia90   Male   1.44
..             ...    ...    ...
774     Jiskjask80   Male   4.19
776         Iral74   Male   1.63
777     Yathecal72   Male   3.46
778        Sisur91   Male   4.19
779      Ennrian78   Male   4.60

[652 rows x 3 columns]

In [92]:
female_price

                  SN  Gender  Price
15         Lisassa64  Female   2.89
18         Reunasu60  Female   4.90
38          Reulae52  Female   4.18
41         Assosia88  Female   1.33
55         Phaelap26  Female   3.79
..               ...     ...    ...
731         Eudanu84  Female   1.02
740        Reunasu60  Female   3.92
754  Pheosurllorin41  Female   4.05
767          Ilmol66  Female   4.88
775       Aethedru70  Female   3.54

[113 rows x 3 columns]

In [93]:
others_price

               SN                 Gender  Price
9     Chanosian48  Other / Non-Disclosed   3.58
22   Siarithria38  Other / Non-Disclosed   3.81
82     Haerithp41  Other / Non-Disclosed   4.40
111      Sundim98  Other / Non-Disclosed   4.75
228   Jiskirran77  Other / Non-Disclosed   3.39
237     Idairin51  Other / Non-Disclosed   3.55
242     Eodaisu60  Other / Non-Disclosed   3.94
291     Idairin51  Other / Non-Disclosed   3.45
350     Rairith81  Other / Non-Disclosed   2.22
401      Lirtim36  Other / Non-Disclosed   1.33
484   Chanosian48  Other / Non-Disclosed   3.94
549    Maluncil97  Other / Non-Disclosed   3.10
629    Maluncil97  Other / Non-Disclosed   2.18
637        Airi27  Other / Non-Disclosed   3.45
747  Siarithria38  Other / Non-Disclosed   3.10

In [94]:
# Stored the gender counts with count()
male_count = male_data["Gender"].count()
female_count = female_data["Gender"].count()
others_count = others_data["Gender"].count()

In [95]:
# Checking the values
print(male_count)
print(female_count)
print(others_count)

652
113
15

In [96]:
# Get all of the average prices of each gender
male_average_price = male_price["Price"].mean()
female_average_price = female_price["Price"].mean()
others_average_price = others_price["Price"].mean()

In [97]:
# Checking the values
print(male_average_price)
print(female_average_price)
print(others_average_price)

3.0178527607361953
3.203008849557519
3.3460000000000005

In [98]:
# Get all of the total prices of each gender
male_total_price = male_price["Price"].sum()
female_total_price = female_price["Price"].sum()
others_total_price = others_price["Price"].sum()

In [99]:
# Checking the values
print(male_total_price)
print(female_total_price)
print(others_total_price)

1967.64
361.94
50.19

In [100]:
# Get grouped data of Gender and names with groupby()
grouped_gp = gender_price.groupby(["Gender","SN","Price"])
print(grouped_gp)
grouped_gp.count()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001A162D5D148>

Empty DataFrame
Columns: []
Index: [(Female, Adastirin33, 4.48), (Female, Aerithllora36, 3.74), (Female, Aerithllora36, 4.9), (Female, Aethedru70, 3.54), (Female, Aidain51, 3.45), (Female, Aiduesu86, 4.48), (Female, Aillyrin83, 2.89), (Female, Aisurdru79, 1.09), (Female, Aisurdru79, 2.42), (Female, Assilsan72, 4.9), (Female, Assosia88, 1.33), (Female, Baelollodeu94, 4.43), (Female, Baelollodeu94, 4.6), (Female, Chadistaya75, 3.94), (Female, Chamast86, 2.05), (Female, Chamilsala65, 3.65), (Female, Chamilsala65, 4.9), (Female, Chamirrasya33, 1.44), (Female, Chamirrasya33, 1.61), (Female, Chamjask73, 4.23), (Female, Chamjask73, 4.76), (Female, Chamjask73, 4.84), (Female, Chanastsda67, 3.7), (Female, Chanirra79, 1.01), (Female, Chanjask65, 4.32), (Female, Chanossast57, 4.32), (Female, Errian63, 3.49), (Female, Eudanu32, 2.85), (Female, Eudanu84, 1.02), (Female, Eusri70, 2.94), (Female, Eusri70, 4.4), (Female, Frichaststa61, 1.79), (Female, Frichosia58, 4.43), (Female, Frichosiala98, 3.54), (Female, Haisurra41, 4.4), (Female, Hari50, 1.98), (Female, Hari50, 3.93), (Female, Heosurnuru52, 2.18), (Female, Heosurnuru52, 2.28), (Female, Heudai45, 3.47), (Female, Heuli25, 3.16), (Female, Heuli25, 3.39), (Female, Heunadil74, 1.54), (Female, Ialallo29, 2.52), (Female, Ialallo29, 4.58), (Female, Ialallo29, 4.74), (Female, Iduenu77, 3.82), (Female, Ilmol66, 1.29), (Female, Ilmol66, 4.88), (Female, Inasuir29, 4.4), (Female, Iskichinya81, 1.33), (Female, Iskichinya81, 3.61), (Female, Isurria36, 1.02), (Female, Jiskjask60, 2.22), (Female, Lassadarsda57, 2.96), (Female, Lassadarsda57, 3.53), (Female, Layjask75, 1.7), (Female, Leyirra83, 3.33), (Female, Leyirra83, 3.97), (Female, Lisassa64, 2.89), (Female, Lisirra58, 2.96), (Female, Lisotesta51, 1.94), (Female, Maradaran90, 2.73), (Female, Marast30, 3.53), (Female, Marilsa69, 1.02), (Female, Marilsa69, 4.23), (Female, Marim28, 1.0), (Female, Marim28, 3.33), (Female, Mindadaran26, 3.75), (Female, Mindilsa34, 2.37), (Female, Phaedue89, 3.85), (Female, Phaelap26, 2.85), (Female, Phaelap26, 3.79), (Female, Pheosurllorin41, 1.33), (Female, Pheosurllorin41, 4.05), (Female, Phyali88, 2.48), (Female, Phyali88, 2.94), (Female, Phyali88, 4.88), (Female, Quanrion96, 3.08), (Female, Quanunwen42, 3.49), (Female, Quilassa66, 4.23), (Female, Reulae52, 4.18), (Female, Reunasu60, 3.92), (Female, Reunasu60, 4.9), (Female, Rithe53, 3.39), (Female, Sally64, 1.33), (Female, Sida61, 1.66), (Female, Sida61, 3.77), (Female, Sondassasya91, 3.81), (Female, Sondim68, 2.21), (Female, Sondim68, 3.45), (Female, Sondistanya61, 3.45), (Female, Sundjask71, 4.0), (Female, Syalollorap93, 4.24), (Female, Syathe73, 1.4), (Female, Taeduenu92, 4.4), (Female, Tyaelistidru84, 3.26), (Female, Tyaelly53, 2.07), (Female, Tyaenasti87, 4.4), (Female, Tyidaim51, 2.73), ...]

[779 rows x 0 columns]

In [101]:
# Grabbed the unique counts of each gender in previous section to use here to find the Avg Total per Person
male_avg_total = male_total_price / unique_male
female_avg_total = female_total_price / unique_female
others_avg_total = others_total_price / unique_others

In [102]:
# Checking the values
print(male_avg_total)
print(female_avg_total)
print(others_avg_total)

4.065371900826446
4.468395061728395
4.5627272727272725

In [105]:
# Put all of the collected data into a DataFrame with their respective indexes
purchasing_gender = pd.DataFrame({
    "Purchase Count": [female_count, male_count, others_count],
    "Average Purchase Price": [female_average_price, male_average_price, others_average_price],
    "Total Purchase Value": [female_total_price, male_total_price, others_total_price],
    "Avg Total Purchase per Person": [female_avg_total, male_avg_total, others_avg_total]}, index = ["Female", "Male", "Other / Non-Disclosed"])
purchasing_gender.index.name = "Gender"
purchasing_gender

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [106]:
# Presenting the data properly with $
purchasing_gender["Average Purchase Price"] = purchasing_gender["Average Purchase Price"].map("${:.2f}".format)
purchasing_gender["Total Purchase Value"] = purchasing_gender["Total Purchase Value"].map("${:.2f}".format)
purchasing_gender["Avg Total Purchase per Person"] = purchasing_gender["Avg Total Purchase per Person"].map("${:.2f}".format)
purchasing_gender

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [5]:
# Example Output

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [315]:
# Get a more focused data for the task
age_data = purchase_data[["SN", "Age", "Price"]]
age_data

                SN  Age  Price
0          Lisim78   20   3.53
1      Lisovynya38   40   1.56
2       Ithergue48   24   4.88
3    Chamassasya86   24   3.27
4        Iskosia90   23   1.44
..             ...  ...    ...
775     Aethedru70   21   3.54
776         Iral74   21   1.63
777     Yathecal72   20   3.46
778        Sisur91    7   4.19
779      Ennrian78   24   4.60

[780 rows x 3 columns]

In [316]:
# Getting the min() and max() to gauge the range of the bin
print(age_data["Age"].min())
print(age_data["Age"].max())

7
45

In [317]:
# Creating bins for each of the age groups
bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 50]

In [318]:
# Creating list of group names for the bins
age_groups = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [319]:
# Slicing the data and placing it into the bins
pd.cut(age_data["Age"], bins, labels=age_groups).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [320]:
age_data["Age Group"] = pd.cut(age_data["Age"], bins, labels=age_groups)
age_data.head()

C:\Users\jana\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

              SN  Age  Price Age Group
0        Lisim78   20   3.53     20-24
1    Lisovynya38   40   1.56       40+
2     Ithergue48   24   4.88     20-24
3  Chamassasya86   24   3.27     20-24
4      Iskosia90   23   1.44     20-24

In [321]:
age_data["SN"].nunique()

576

In [399]:
# Store the groupby data, then using it to get the total counts
age_group_data = age_data.groupby("Age Group")
print(age_group_data)
age_group_data["SN"].nunique()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001A162FE91C8>

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [400]:
# Extracting the number of unique names that are <10
age_under_10 = age_data.loc[age_data["Age"] < 10].nunique()
age_under_10[0]

17

In [401]:
# Extracting the number of unique names that are between 10-14
age_between_10_14 = age_data.loc[(age_data["Age"] >= 10) & (age_data["Age"] <= 14)].nunique()
age_between_10_14[0]

22

In [402]:
# Extracting the number of unique names that are between 15-19
age_between_15_19 = age_data.loc[(age_data["Age"] >= 15) & (age_data["Age"] <= 19)].nunique()
age_between_15_19[0]

107

In [403]:
# Extracting the number of unique names that are between 20-24
age_between_20_24 = age_data.loc[(age_data["Age"] >= 20) & (age_data["Age"] <= 24)].nunique()
age_between_20_24[0]

258

In [404]:
# Extracting the number of unique names that are between 25-29
age_between_25_29 = age_data.loc[(age_data["Age"] >= 25) & (age_data["Age"] <= 29)].nunique()
age_between_25_29[0]

77

In [405]:
# Extracting the number of unique names that are between 30-34
age_between_30_34 = age_data.loc[(age_data["Age"] >= 30) & (age_data["Age"] <= 34)].nunique()
age_between_30_34[0]

52

In [406]:
# Extracting the number of unique names that are between 35-39
age_between_35_39 = age_data.loc[(age_data["Age"] >= 35) & (age_data["Age"] <= 39)].nunique()
age_between_35_39[0]

31

In [407]:
# Extracting the number of unique names that are 40 and over
age_40_over = age_data.loc[(age_data["Age"] >= 40)].nunique()
age_40_over[0]

12

In [408]:
# Creating a list to store unique amount of names values
num_name_list = [age_under_10[0],
                age_between_10_14[0],
                age_between_15_19[0],
                age_between_20_24[0],
                age_between_25_29[0],
                age_between_30_34[0],
                age_between_35_39[0],
                age_40_over[0]]
num_name_list

[17, 22, 107, 258, 77, 52, 31, 12]

In [409]:
# Bringing back the value of total players from the 1st task
total_player

576

In [410]:
# Getting all the percentage of players from each age group
under_10_perc = age_under_10[0] / total_player
btw_10_14_perc = age_between_10_14[0] / total_player
btw_15_19_perc = age_between_15_19[0] / total_player
btw_20_24_perc = age_between_20_24[0] / total_player
btw_25_29_perc = age_between_25_29[0] / total_player
btw_30_34_perc = age_between_30_34[0] / total_player
btw_35_39_perc = age_between_35_39[0] / total_player
over_40_perc = age_40_over[0] / total_player

In [411]:
# Creating a list to store percentage of players values
players_perc_list = [under_10_perc,
                    btw_10_14_perc,
                    btw_15_19_perc,
                    btw_20_24_perc,
                    btw_25_29_perc,
                    btw_30_34_perc,
                    btw_35_39_perc,
                    over_40_perc]
players_perc_list

[0.029513888888888888,
 0.03819444444444445,
 0.1857638888888889,
 0.4479166666666667,
 0.13368055555555555,
 0.09027777777777778,
 0.05381944444444445,
 0.020833333333333332]

In [412]:
# Putting all the data into a DataFrame with their respective indexes
age_demo = pd.DataFrame({
    "Total Count":[num_name_list[0],
                   num_name_list[1],
                   num_name_list[2],
                   num_name_list[3],
                   num_name_list[4],
                   num_name_list[5],
                   num_name_list[6],
                   num_name_list[7]],
    "Percentage of Players":[players_perc_list[0] * 100,
                             players_perc_list[1] * 100,
                             players_perc_list[2] * 100,
                             players_perc_list[3] * 100,
                             players_perc_list[4] * 100,
                             players_perc_list[5] * 100,
                             players_perc_list[6] * 100,
                             players_perc_list[7] * 100]
}, index = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"])
age_demo

       Total Count  Percentage of Players
<10             17               2.951389
10-14           22               3.819444
15-19          107              18.576389
20-24          258              44.791667
25-29           77              13.368056
30-34           52               9.027778
35-39           31               5.381944
40+             12               2.083333

In [413]:
# Presenting the Percentage of Players properly with %
age_demo["Percentage of Players"] = age_demo["Percentage of Players"].map("{0:.2f}%".format)
age_demo

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

In [6]:
# Example Output

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [371]:
# Purchase Count of Age Groups
count_under_10 = age_data.loc[age_data["Age"] < 10].count()
count_10_14 = age_data.loc[(age_data["Age"] >= 10) & (age_data["Age"] <= 14)].count()
count_15_19 = age_data.loc[(age_data["Age"] >= 15) & (age_data["Age"] <= 19)].count()
count_20_24 = age_data.loc[(age_data["Age"] >= 20) & (age_data["Age"] <= 24)].count()
count_25_29 = age_data.loc[(age_data["Age"] >= 25) & (age_data["Age"] <= 29)].count()
count_30_34 = age_data.loc[(age_data["Age"] >= 30) & (age_data["Age"] <= 34)].count()
count_35_39 = age_data.loc[(age_data["Age"] >= 35) & (age_data["Age"] <= 39)].count()
count_40_over = age_data.loc[(age_data["Age"] >= 40)].count()

In [372]:
# Creating a list to store the purchase count values
count_list = [count_under_10[0],
             count_10_14[0],
             count_15_19[0],
             count_20_24[0],
             count_25_29[0],
             count_30_34[0],
             count_35_39[0],
             count_40_over[0]]
count_list

[23, 28, 136, 365, 101, 73, 41, 13]

In [384]:
# Average Purchase Price of Age Groups
avg_under_10 = age_data.loc[age_data["Age"] < 10].mean()
avg_10_14 = age_data.loc[(age_data["Age"] >= 10) & (age_data["Age"] <= 14)].mean()
avg_15_19 = age_data.loc[(age_data["Age"] >= 15) & (age_data["Age"] <= 19)].mean()
avg_20_24 = age_data.loc[(age_data["Age"] >= 20) & (age_data["Age"] <= 24)].mean()
avg_25_29 = age_data.loc[(age_data["Age"] >= 25) & (age_data["Age"] <= 29)].mean()
avg_30_34 = age_data.loc[(age_data["Age"] >= 30) & (age_data["Age"] <= 34)].mean()
avg_35_39 = age_data.loc[(age_data["Age"] >= 35) & (age_data["Age"] <= 39)].mean()
avg_40_over = age_data.loc[(age_data["Age"] >= 40)].mean()

In [385]:
# Creating a list to store the average purchase price values
avg_price_list = [avg_under_10[1],
             avg_10_14[1],
             avg_15_19[1],
             avg_20_24[1],
             avg_25_29[1],
             avg_30_34[1],
             avg_35_39[1],
             avg_40_over[1]]
avg_price_list

[3.353478260869565,
 2.956428571428571,
 3.03595588235294,
 3.0522191780821935,
 2.900990099009899,
 2.9315068493150687,
 3.6017073170731706,
 2.9415384615384617]

In [386]:
# Total Purchase Value of Age Groups
total_under_10 = age_data.loc[age_data["Age"] < 10].sum()
total_10_14 = age_data.loc[(age_data["Age"] >= 10) & (age_data["Age"] <= 14)].sum()
total_15_19 = age_data.loc[(age_data["Age"] >= 15) & (age_data["Age"] <= 19)].sum()
total_20_24 = age_data.loc[(age_data["Age"] >= 20) & (age_data["Age"] <= 24)].sum()
total_25_29 = age_data.loc[(age_data["Age"] >= 25) & (age_data["Age"] <= 29)].sum()
total_30_34 = age_data.loc[(age_data["Age"] >= 30) & (age_data["Age"] <= 34)].sum()
total_35_39 = age_data.loc[(age_data["Age"] >= 35) & (age_data["Age"] <= 39)].sum()
total_40_over = age_data.loc[(age_data["Age"] >= 40)].sum()

In [414]:
# Creating a list to store the total purchase values
total_list = [total_under_10[2],
             total_10_14[2],
             total_15_19[2],
             total_20_24[2],
             total_25_29[2],
             total_30_34[2],
             total_35_39[2],
             total_40_over[2]]
total_list

[77.13,
 82.77999999999999,
 412.8899999999998,
 1114.0600000000006,
 292.99999999999983,
 214.0,
 147.67,
 38.24]

In [416]:
# Average Purchase Total per Person by Age Group
    #Total / Unique Names by Age Group
average_per_list = [total_list[0] / num_name_list[0],
                    total_list[1] / num_name_list[1],
                    total_list[2] / num_name_list[2],
                    total_list[3] / num_name_list[3],
                    total_list[4] / num_name_list[4],
                    total_list[5] / num_name_list[5],
                    total_list[6] / num_name_list[6],
                    total_list[7] / num_name_list[7]]
average_per_list

[4.537058823529412,
 3.7627272727272723,
 3.85878504672897,
 4.3180620155038785,
 3.805194805194803,
 4.115384615384615,
 4.763548387096773,
 3.186666666666667]

In [417]:
age_analysis = pd.DataFrame({
    "Purchase Count":[count_list[0],
                     count_list[1],
                     count_list[2],
                     count_list[3],
                     count_list[4],
                     count_list[5],
                     count_list[6],
                     count_list[7],],
    "Average Purchase Price":[avg_price_list[0],
                             avg_price_list[1],
                             avg_price_list[2],
                             avg_price_list[3],
                             avg_price_list[4],
                             avg_price_list[5],
                             avg_price_list[6],
                             avg_price_list[7]],
    "Total Purchase Value":[total_list[0],
                           total_list[1],
                           total_list[2],
                           total_list[3],
                           total_list[4],
                           total_list[5],
                           total_list[6],
                           total_list[7]],
    "Avg Total Purchase per Person":[average_per_list[0],
                                    average_per_list[1],
                                    average_per_list[2],
                                    average_per_list[3],
                                    average_per_list[4],
                                    average_per_list[5],
                                    average_per_list[6],
                                    average_per_list[7]]
},index=["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"])
age_analysis.index.name = "Age Ranges"
age_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [418]:
# Presenting the data properly with $
age_analysis["Average Purchase Price"] = age_analysis["Average Purchase Price"].map("${:.2f}".format)
age_analysis["Total Purchase Value"] = age_analysis["Total Purchase Value"].map("${:.2f}".format)
age_analysis["Avg Total Purchase per Person"] = age_analysis["Avg Total Purchase per Person"].map("${:.2f}".format)
age_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,$1114.06,$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

In [7]:
# Example Output

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [475]:
# Getting the 5 SN and Purchase Counts
top_spend = purchase_data["SN",].value_counts()
top_spend.head(30)

Lisosia93       5
Iral74          4
Idastidru52     4
Chanastnya43    3
Zontibe81       3
Aelin32         3
Idai61          3
Saistyphos30    3
Tyidaim51       3
Lisopela58      3
Inguron55       3
Iri67           3
Lisim78         3
Yathecal82      3
Hada39          3
Strithenu87     3
Lassilsala30    3
Chamjask73      3
Silaera56       3
Chadolyla44     3
Phaena87        3
Haillyrgue51    3
Chamimla85      3
Tyisur83        3
Pheodaisun84    3
Hiaral50        3
Rarallo90       3
Ialallo29       3
Phyali88        3
Iskadarya95     3
Name: SN, dtype: int64

In [474]:
#top_spend.head(30)

In [476]:
# Checking the values
    # SN values
print(top_spend.index[0])
print(top_spend.index[1])
print(top_spend.index[2])
print(top_spend.index[17])
print(top_spend.index[29])
    #Purchase Count values
print(top_spend[0])
print(top_spend[1])
print(top_spend[2])
print(top_spend[17])
print(top_spend[29])

Lisosia93
Iral74
Idastidru52
Chamjask73
Iskadarya95
5
4
4
3
3

In [477]:
# Average Purchase Price
sn_avg1 = purchase_data.loc[(purchase_data["SN"] == "Lisosia93") & (purchase_data["Price"] > 0)].mean()
sn_avg2 = purchase_data.loc[(purchase_data["SN"] == "Iral74") & (purchase_data["Price"] > 0)].mean()
sn_avg3 = purchase_data.loc[(purchase_data["SN"] == "Idastidru52") & (purchase_data["Price"] > 0)].mean()
sn_avg4 = purchase_data.loc[(purchase_data["SN"] == "Chamjask73") & (purchase_data["Price"] > 0)].mean()
sn_avg5 = purchase_data.loc[(purchase_data["SN"] == "Iskadarya95") & (purchase_data["Price"] > 0)].mean()

In [478]:
# Checking with array to use
sn_avg1

Purchase ID    326.000
Age             25.000
Item ID         88.400
Price            3.792
dtype: float64

In [479]:
# Creating a list to store the average purchase price values
sn_avg_list = [sn_avg1[3],
              sn_avg2[3],
              sn_avg3[3],
              sn_avg4[3],
              sn_avg5[3]]
sn_avg_list

[3.7920000000000003, 3.4049999999999994, 3.8625, 4.61, 4.366666666666666]

In [480]:
# Total Purchase Value
sn_total1 = purchase_data.loc[(purchase_data["SN"] == "Lisosia93") & (purchase_data["Price"] > 0)].sum()
sn_total2 = purchase_data.loc[(purchase_data["SN"] == "Iral74") & (purchase_data["Price"] > 0)].sum()
sn_total3 = purchase_data.loc[(purchase_data["SN"] == "Idastidru52") & (purchase_data["Price"] > 0)].sum()
sn_total4 = purchase_data.loc[(purchase_data["SN"] == "Chamjask73") & (purchase_data["Price"] > 0)].sum()
sn_total5 = purchase_data.loc[(purchase_data["SN"] == "Iskadarya95") & (purchase_data["Price"] > 0)].sum()

In [481]:
# Checking with array to use
sn_total1

Purchase ID                                                 1630
SN                 Lisosia93Lisosia93Lisosia93Lisosia93Lisosia93
Age                                                          125
Gender                                      MaleMaleMaleMaleMale
Item ID                                                      442
Item Name      Blazefury, Protector of DelusionsWarped Fetish...
Price                                                      18.96
dtype: object

In [482]:
# Creating a list to store the total purchase values
sn_total_list = [sn_total1[6],
              sn_total2[6],
              sn_total3[6],
              sn_total4[6],
              sn_total5[6]]
sn_total_list

[18.96, 13.619999999999997, 15.45, 13.83, 13.1]

In [483]:
# Putting data in a DataFrame with their respective indexes
top_spenders = pd.DataFrame({
    "Purchase Count":[top_spend[0],
                     top_spend[1],
                     top_spend[2],
                     top_spend[17],
                     top_spend[29]],
    "Average Purchase Price":[sn_avg_list[0],
                       sn_avg_list[1],
                       sn_avg_list[2],
                       sn_avg_list[3],
                       sn_avg_list[4]],
    "Total Purchase Value":[sn_total_list[0],
                           sn_total_list[1],
                           sn_total_list[2],
                           sn_total_list[3],
                           sn_total_list[4]]
}, index=[top_spend.index[0],top_spend.index[1],top_spend.index[2],top_spend.index[17],top_spend.index[29]])
top_spenders.index.name = "SN"
top_spenders

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Iral74                    4                3.405000                 13.62
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iskadarya95               3                4.366667                 13.10

In [484]:
# Sorting by highest Total Purchase Value to lowest
sorted_top = top_spenders.sort_values("Total Purchase Value", ascending=False)
sorted_top

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [485]:
# Presenting the data properly with $
sorted_top["Average Purchase Price"] = sorted_top["Average Purchase Price"].map("${:.2f}".format)
sorted_top["Total Purchase Value"] = sorted_top["Total Purchase Value"].map("${:.2f}".format)
sorted_top

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

In [8]:
# Example Output

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [557]:
# Retrieving only the columns that are needed for this task
popular_data = purchase_data[["Item ID", "Item Name", "Price"]]
popular_data.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [558]:
# Retrieving the most occurred purchases
popular_df = popular_data["Item Name"].value_counts()
popular_df.head(10)

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Nirvana                                          9
Fiery Glass Crusader                             9
Extraction, Quickblade Of Trembling Hands        9
Persuasion                                       9
Singed Scalpel                                   8
Lightning, Etcher of the King                    8
Winter's Bite                                    8
Brutality Ivory Warmace                          8
Name: Item Name, dtype: int64

In [559]:
# Item Name
item_name1 = popular_df.index[0]
item_name2 = popular_df.index[1]
item_name3 = popular_df.index[3]
item_name4 = popular_df.index[4]
item_name5 = popular_df.index[5]

In [560]:
# Creating a list to store the item names
item_name_list = [item_name1,
                 item_name2,
                 item_name3,
                 item_name4,
                 item_name5]
item_name_list

['Final Critic',
 'Oathbreaker, Last Hope of the Breaking Storm',
 'Fiery Glass Crusader',
 'Extraction, Quickblade Of Trembling Hands',
 'Persuasion']

In [561]:
# Finding the Item ID of one Item Name first
popular_data.loc[(popular_data["Item Name"] == item_name_list[0]) & (purchase_data["Item ID"] > 0)]

     Item ID     Item Name  Price
2         92  Final Critic   4.88
99        92  Final Critic   4.19
252       92  Final Critic   4.88
273       92  Final Critic   4.88
277       92  Final Critic   4.88
411       92  Final Critic   4.19
536       92  Final Critic   4.19
712       92  Final Critic   4.88
722       92  Final Critic   4.88
767       92  Final Critic   4.88
768       92  Final Critic   4.88
774       92  Final Critic   4.19
778       92  Final Critic   4.19

In [562]:
# Item ID
item_id1 = popular_data.loc[(popular_data["Item Name"] == item_name_list[0]) & (purchase_data["Item ID"] > 0)]
item_id2 = popular_data.loc[(popular_data["Item Name"] == item_name_list[1]) & (purchase_data["Item ID"] > 0)]
item_id3 = popular_data.loc[(popular_data["Item Name"] == item_name_list[2]) & (purchase_data["Item ID"] > 0)]
item_id4 = popular_data.loc[(popular_data["Item Name"] == item_name_list[3]) & (purchase_data["Item ID"] > 0)]
item_id5 = popular_data.loc[(popular_data["Item Name"] == item_name_list[4]) & (purchase_data["Item ID"] > 0)]

In [563]:
# Creating a list of item ids, using mean() to create the value
item_id_list = [item_id1["Item ID"].mean(),
               item_id2["Item ID"].mean(),
               item_id3["Item ID"].mean(),
               item_id4["Item ID"].mean(),
               item_id5["Item ID"].mean()]
item_id_list

[92.0, 178.0, 145.0, 108.0, 132.0]

In [564]:
# Purchase Count
item_count1 = popular_df[0]
item_count2 = popular_df[1]
item_count3 = popular_df[3]
item_count4 = popular_df[4]
item_count5 = popular_df[5]

In [565]:
# Creating a list to purchase count values
item_count_list = [item_count1,
                  item_count2,
                  item_count3,
                  item_count4,
                  item_count5]
item_count_list

[13, 12, 9, 9, 9]

In [566]:
# Creating a list of the average of the Item Prices
item_price_list = [item_id1["Price"].mean(),
                   item_id2["Price"].mean(),
                   item_id3["Price"].mean(),
                   item_id4["Price"].mean(),
                   item_id5["Price"].mean()]
item_price_list

[4.614615384615385,
 4.230000000000001,
 4.579999999999999,
 3.5300000000000002,
 3.2211111111111115]

In [569]:
# Creating a list of the total of the Item Prices
item_total_list = [item_id1["Price"].sum(),
                   item_id2["Price"].sum(),
                   item_id3["Price"].sum(),
                   item_id4["Price"].sum(),
                   item_id5["Price"].sum()]
item_total_list

[59.99, 50.76000000000002, 41.22, 31.77, 28.989999999999995]

In [570]:
# Putting the data in a DataFrame with their respective indexes
most_popular = pd.DataFrame({
    "Item Name":[item_name_list[0],
                item_name_list[1],
                item_name_list[2],
                item_name_list[3],
                item_name_list[4]],
    "Purchase Count":[item_count_list[0],
                     item_count_list[1],
                     item_count_list[2],
                     item_count_list[3],
                     item_count_list[4],],
    "Item Price":[item_price_list[0],
                 item_price_list[1],
                 item_price_list[2],
                 item_price_list[3],
                 item_price_list[4],],
    "Total Purchase Value":[item_total_list[0],
                           item_total_list[1],
                           item_total_list[2],
                           item_total_list[3],
                           item_total_list[4]]
}, index=["92", "178", "145", "108", "132"])
most_popular.index.name = "Item ID"
most_popular

,Item Name,Purchase Count,Item Price,Total Purchase Value
Item ID,,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77
132,Persuasion,9,3.221111,28.99

In [574]:
# Sorting the value from highest Purchase Count to lowest
sorted_most_popular = most_popular.sort_values("Purchase Count", ascending=False)
sorted_most_popular

,Item Name,Purchase Count,Item Price,Total Purchase Value
Item ID,,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77
132,Persuasion,9,3.221111,28.99

In [576]:
# Presenting
sorted_most_popular["Item Price"] = sorted_most_popular["Item Price"].map("${:.2f}".format)
sorted_most_popular["Total Purchase Value"] = sorted_most_popular["Total Purchase Value"].map("${:.2f}".format)
sorted_most_popular

,Item Name,Purchase Count,Item Price,Total Purchase Value
Item ID,,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
132,Persuasion,9,$3.22,$28.99

In [9]:
# Example Output

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [578]:
# Pulling up the popular list
popular_df.head(10)

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Nirvana                                          9
Fiery Glass Crusader                             9
Extraction, Quickblade Of Trembling Hands        9
Persuasion                                       9
Singed Scalpel                                   8
Lightning, Etcher of the King                    8
Winter's Bite                                    8
Brutality Ivory Warmace                          8
Name: Item Name, dtype: int64

In [586]:
# Item Names
item2_name1 = popular_df.index[0]
item2_name2 = popular_df.index[1]
item2_name3 = popular_df.index[2]
item2_name4 = popular_df.index[3]
item2_name5 = popular_df.index[6]

In [587]:
# Creating a list
item2_name_list = [item2_name1,
                 item2_name2,
                 item2_name3,
                 item2_name4,
                 item2_name5]
item2_name_list

['Final Critic',
 'Oathbreaker, Last Hope of the Breaking Storm',
 'Nirvana',
 'Fiery Glass Crusader',
 'Singed Scalpel']

In [588]:
# Item ID
item2_id1 = popular_data.loc[(popular_data["Item Name"] == item2_name_list[0]) & (purchase_data["Item ID"] > 0)]
item2_id2 = popular_data.loc[(popular_data["Item Name"] == item2_name_list[1]) & (purchase_data["Item ID"] > 0)]
item2_id3 = popular_data.loc[(popular_data["Item Name"] == item2_name_list[2]) & (purchase_data["Item ID"] > 0)]
item2_id4 = popular_data.loc[(popular_data["Item Name"] == item2_name_list[3]) & (purchase_data["Item ID"] > 0)]
item2_id5 = popular_data.loc[(popular_data["Item Name"] == item2_name_list[4]) & (purchase_data["Item ID"] > 0)]

In [583]:
# Purchase Count
item2_count1 = popular_df[0]
item2_count2 = popular_df[1]
item2_count3 = popular_df[2]
item2_count4 = popular_df[3]
item2_count5 = popular_df[6]

In [585]:
# Creaing a list
item2_count_list = [item2_count1,
                  item2_count2,
                  item2_count3,
                  item2_count4,
                  item2_count5]
item2_count_list

[13, 12, 9, 9, 8]

In [590]:
# Creating a list
item2_price_list = [item2_id1["Price"].mean(),
                   item2_id2["Price"].mean(),
                   item2_id3["Price"].mean(),
                   item2_id4["Price"].mean(),
                   item2_id5["Price"].mean()]
item2_price_list

[4.614615384615385,
 4.230000000000001,
 4.8999999999999995,
 4.579999999999999,
 4.3500000000000005]

In [591]:
item2_total_list = [item2_id1["Price"].sum(),
                   item2_id2["Price"].sum(),
                   item2_id3["Price"].sum(),
                   item2_id4["Price"].sum(),
                   item2_id5["Price"].sum()]
item2_total_list

[59.99, 50.76000000000002, 44.1, 41.22, 34.8]

In [592]:
# Putting the data in a DataFrame with their respective indexes
most_profitable = pd.DataFrame({
    "Item Name":[item2_name_list[0],
                item2_name_list[1],
                item2_name_list[2],
                item2_name_list[3],
                item2_name_list[4]],
    "Purchase Count":[item2_count_list[0],
                     item2_count_list[1],
                     item2_count_list[2],
                     item2_count_list[3],
                     item2_count_list[4],],
    "Item Price":[item2_price_list[0],
                 item2_price_list[1],
                 item2_price_list[2],
                 item2_price_list[3],
                 item2_price_list[4],],
    "Total Purchase Value":[item2_total_list[0],
                           item2_total_list[1],
                           item2_total_list[2],
                           item2_total_list[3],
                           item2_total_list[4]]
}, index=["92", "178", "82", "145", "103"])
most_profitable.index.name = "Item ID"
most_profitable

,Item Name,Purchase Count,Item Price,Total Purchase Value
Item ID,,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80

In [595]:
# Sorting the data by highest Total Purchase Value
sorted_most_profitable = most_profitable.sort_values("Total Purchase Value", ascending=False)
sorted_most_profitable

,Item Name,Purchase Count,Item Price,Total Purchase Value
Item ID,,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80

In [596]:
# Presenting
sorted_most_profitable["Item Price"] = sorted_most_profitable["Item Price"].map("${:.2f}".format)
sorted_most_profitable["Total Purchase Value"] = sorted_most_profitable["Total Purchase Value"].map("${:.2f}".format)
sorted_most_profitable

,Item Name,Purchase Count,Item Price,Total Purchase Value
Item ID,,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80

In [10]:
# Example Output

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80